SOAPRequests/SOAPRequest_nonTokenWithData.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<s:Header>
		<a:Action s:mustUnderstand="1">http://tempuri.org/ISmartSocketsWebService/SetNewRoom</a:Action>
		<a:MessageID>urn:uuid:6bca00e9-9c47-4138-b9e0-3bf1d8a5afff</a:MessageID>
		<a:ReplyTo>
			<a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
		</a:ReplyTo>
		<a:To s:mustUnderstand="1">https://ent-ml15aaf-1.herts.ac.uk/ServiceImplimentation/Start.svc</a:To>
		<o:Security s:mustUnderstand="1" xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<u:Timestamp u:Id="_0">
				<u:Created>2016-05-18T09:55:05.416Z</u:Created>
				<u:Expires>2016-05-18T10:00:05.416Z</u:Expires>
			</u:Timestamp>
			<o:UsernameToken u:Id="uuid-7e8508b7-5322-420a-8fff-bf3685ad3c02-1">
				<o:Username>root</o:Username>
				<o:Password o:Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">root</o:Password>
			</o:UsernameToken>
		</o:Security>
	</s:Header>
	<s:Body>
		<SetNewRoom xmlns="http://tempuri.org/">
			<room xmlns:b="http://schemas.datacontract.org/2004/07/SmartSocketsWebService" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
				<b:PropertyID>3</b:PropertyID>
				<b:RoomID>0</b:RoomID>
			</room>
		</SetNewRoom>
	</s:Body>
</s:Envelope>